# ML WEEK-02 DAY-01 + DAY-02+ DAY-03

**🐼 Introduction to the Pandas Library (Python)**

Pandas is a powerful and widely-used open-source Python library for data analysis and data manipulation. It provides data structures and functions needed to work with structured data seamlessly.   

**✅ Why Use Pandas?**

Easy to load, clean, analyze, and visualize data.

Works well with CSV, Excel, SQL, JSON, and more.

Built on top of NumPy, and often used with Matplotlib and Seaborn.

**🔧 Key Data Structures**

Series: One-dimensional labeled array (like a column in Excel).

DataFrame: A DataFrame is a 2-dimensional, tabular data structure with labeled rows and columns, similar to a spreadsheet or SQL table.

a. Rows have indices (labels).

b. Columns have names (labels).

In [ ]:
import pandas as pd

**Creating a Series using pd.series:**

In [ ]:
import pandas as pd

# Example 1: Simple Series from a list
s = pd.Series([10, 20, 30, 40])
print(s)

# Example 2: Series with custom index
s2 = pd.Series([100, 200, 300], index=['a', 'b', 'c'])
print(s2)

0    10
1    20
2    30
3    40
dtype: int64
a    100
b    200
c    300
dtype: int64

**Creating DataFrame from Series:**

In [ ]:
# Convert a Series to DataFrame
s2 = pd.Series([100, 200, 300], index=['a', 'b', 'c'])

df_from_series = pd.DataFrame(s2, columns=['Values'])
print(df_from_series)

   Values
a     100
b     200
c     300

**Creating DataFrame from Dictionary:**

In [ ]:

import pandas as pd
# Dictionary with lists
data = {
    'Name': ['Ali', 'Zara', 'Ahmed'],
    'Age': [23, 25, 22],
    'City': ['Lahore', 'Karachi', 'Islamabad']
}

df = pd.DataFrame(data)
print(df)

    Name  Age       City
0    Ali   23     Lahore
1   Zara   25    Karachi
2  Ahmed   22  Islamabad

**Creating a DataFrame from a dictionary of Series:**

In [ ]:

import pandas as pd
# Dictionary of Series
data = {
    'Math': pd.Series([90, 80, 70], index=['a', 'b', 'c']),
    'Science': pd.Series([88, 92, 95], index=['a', 'b', 'c'])
}

df = pd.DataFrame(data)
print(df)

   Math  Science
a    90       88
b    80       92
c    70       95

In [ ]:
import pandas as pd
series = pd.Series([10,20,30,40])
print(series)
print(series.values)
print(series.index)
print(series.dtype)
print(series.shape)
print(series.name)
series.name = "Series"
print(series.name)

series = pd.Series([10,20,30,40],index=['a','b','c','d'])
print(series)
print(series.values)
print(series.index)
print(series.dtype)
print(series.shape)
print(series.name)
series.name = "Series"
print(series.name)

0    10
1    20
2    30
3    40
dtype: int64
[10 20 30 40]
RangeIndex(start=0, stop=4, step=1)
int64
(4,)
None
Series
a    10
b    20
c    30
d    40
dtype: int64
[10 20 30 40]
Index(['a', 'b', 'c', 'd'], dtype='object')
int64
(4,)
None
Series

**Accessing indexes using loc and iloc:**

In [ ]:
import pandas as pd
df = pd.DataFrame({
    'Name': ['Ali', 'Zara', 'Ahmed'],
    'Age': [23, 25, 22],
    'City': ['Lahore', 'Karachi', 'Islamabad']
}, index=['a','b','c'])
print(df)
# To know the data type of each column
print(df.dtypes)
# .loc --> Using label based indexing
print("\nUsing loc:\n")
print(df.loc['a'])
print(df.loc['a':'c'])
print(df.loc['a','Name'])
print(df.loc['a',['Name','City']])

#.iloc --> Position based indexing
print("\nUsing iloc:\n")
print(df.iloc[0])
print(df.iloc[0:2])
print(df.iloc[0,0])
print(df.iloc[0,[0,2]])

    Name  Age       City
a    Ali   23     Lahore
b   Zara   25    Karachi
c  Ahmed   22  Islamabad
Name    object
Age      int64
City    object
dtype: object

Using loc:

Name       Ali
Age         23
City    Lahore
Name: a, dtype: object
    Name  Age       City
a    Ali   23     Lahore
b   Zara   25    Karachi
c  Ahmed   22  Islamabad
Ali
Name       Ali
City    Lahore
Name: a, dtype: object

Using iloc:

Name       Ali
Age         23
City    Lahore
Name: a, dtype: object
   Name  Age     City
a   Ali   23   Lahore
b  Zara   25  Karachi
Ali
Name       Ali
City    Lahore
Name: a, dtype: object

In [ ]:
import pandas as pd
df = pd.DataFrame({
    'Name': ['Ali', 'Zara', 'Ahmed'],
    'Age': [23, 25, 22],
    'City': ['Lahore', 'Karachi', 'Islamabad']
}, index=['a','b','c'])
print(df)

print(df["Name"].str.lower())
print(df["City"].str.contains('a'))
print(df["City"].str.contains('o'))
print(df["City"].isin(["Lahore","Paris","NewYork"]))

print(type(df['Age']))
print(type(df[['Age']]))
print(df[["Name","City"]])

    Name  Age       City
a    Ali   23     Lahore
b   Zara   25    Karachi
c  Ahmed   22  Islamabad
a      ali
b     zara
c    ahmed
Name: Name, dtype: object
a    True
b    True
c    True
Name: City, dtype: bool
a     True
b    False
c    False
Name: City, dtype: bool
a     True
b    False
c    False
Name: City, dtype: bool
<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>
    Name       City
a    Ali     Lahore
b   Zara    Karachi
c  Ahmed  Islamabad

In [ ]:
data = {
    'Name': ['Ali', 'Sara', 'John'],
    'Age': [24, 22, 26]
}

df = pd.DataFrame(data)
print(df)

df.to_csv("output.csv")
print(df)

df.to_csv("output1.csv",index=False)
print(df)

   Name  Age
0   Ali   24
1  Sara   22
2  John   26
   Name  Age
0   Ali   24
1  Sara   22
2  John   26
   Name  Age
0   Ali   24
1  Sara   22
2  John   26

**💾 Saving Data to Excel and JSON Formats**

🔸 Saving to Excel:
Use to_excel() to save a DataFrame as an Excel file.

Example:

df.to_excel("output.xlsx", index=False)

index=False is used to prevent writing row numbers to the file.

🔸 Saving to JSON:
Use to_json() to save data in JSON format.

Example:

df.to_json("output.json", orient="records")

orient="records" saves the data as a list of dictionaries, which is a commonly used format.

**Reading the data:**

df = pdf.read_csv("filename", encoding = "latin1")

df = pd.read_excel("filename.xlsx")

df = pd.read_json("filename.json")

In [ ]:
df = pd.read_csv("/content/sales_data_sample.csv", encoding= "latin1")

In [ ]:
print(df)

      ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
0           10107               30      95.70                2  2871.00
1           10121               34      81.35                5  2765.90
2           10134               41      94.74                2  3884.34
3           10145               45      83.26                6  3746.70
4           10159               49     100.00               14  5205.27
...           ...              ...        ...              ...      ...
2818        10350               20     100.00               15  2244.40
2819        10373               29     100.00                1  3978.51
2820        10386               43     100.00                4  5417.57
2821        10397               34      62.24                1  2116.16
2822        10414               47      65.52                9  3079.44

            ORDERDATE    STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
0      2/24/2003 0:00   Shipped       1         2     2003  ...
1       5/7/2003 0:00   Shipped       2         5     2003  ...
2       7/1/2003 0:00   Shipped       3         7     2003  ...
3      8/25/2003 0:00   Shipped       3         8     2003  ...
4     10/10/2003 0:00   Shipped       4        10     2003  ...
...               ...       ...     ...       ...      ...  ...
2818   12/2/2004 0:00   Shipped       4        12     2004  ...
2819   1/31/2005 0:00   Shipped       1         1     2005  ...
2820    3/1/2005 0:00  Resolved       1         3     2005  ...
2821   3/28/2005 0:00   Shipped       1         3     2005  ...
2822    5/6/2005 0:00   On Hold       2         5     2005  ...

                       ADDRESSLINE1  ADDRESSLINE2           CITY STATE  \
0           897 Long Airport Avenue           NaN            NYC    NY
1                59 rue de l'Abbaye           NaN          Reims   NaN
2     27 rue du Colonel Pierre Avia           NaN          Paris   NaN
3                78934 Hillside Dr.           NaN       Pasadena    CA
4                   7734 Strong St.           NaN  San Francisco    CA
...                             ...           ...            ...   ...
2818             C/ Moralzarzal, 86           NaN         Madrid   NaN
2819                    Torikatu 38           NaN           Oulu   NaN
2820             C/ Moralzarzal, 86           NaN         Madrid   NaN
2821          1 rue Alsace-Lorraine           NaN       Toulouse   NaN
2822             8616 Spinnaker Dr.           NaN         Boston    MA

     POSTALCODE  COUNTRY TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
0         10022      USA       NaN              Yu             Kwai    Small
1         51100   France      EMEA         Henriot             Paul    Small
2         75508   France      EMEA        Da Cunha           Daniel   Medium
3         90003      USA       NaN           Young            Julie   Medium
4           NaN      USA       NaN           Brown            Julie   Medium
...         ...      ...       ...             ...              ...      ...
2818      28034    Spain      EMEA          Freyre            Diego    Small
2819      90110  Finland      EMEA       Koskitalo           Pirkko   Medium
2820      28034    Spain      EMEA          Freyre            Diego   Medium
2821      31000   France      EMEA          Roulet          Annette    Small
2822      51003      USA       NaN         Yoshido             Juri   Medium

[2823 rows x 25 columns]

🔹 df.shape

Purpose: Tells you the dimensions of the DataFrame.

Returns: A tuple in the form (number of rows, number of columns)

🔹 df.head()
Purpose: Displays the first 5 rows of the DataFrame by default.

Usage:

df.head()         # First 5 rows
df.head(10)       # First 10 rows

🔹 df.tail()
Purpose: Displays the last 5 rows of the DataFrame by default.

Usage:

df.tail()         # Last 5 rows
df.tail(10)       # Last 10 rows

🔹 df.columns
Returns a list of column names in the DataFrame.

🔹 df.dtypes
Shows the data type of each column.

🔹 df.describe()
Generates descriptive statistics for numeric columns:

Count, mean, std, min, max, 25%, 50%, 75% quartiles

🔹 df.sample(n)
Returns a random sample of n rows from the DataFrame.

In [ ]:
print(df.dtypes)

Name    object
Age      int64
City    object
dtype: object

In [ ]:
print(df.shape)

(2823, 25)

In [ ]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2823 entries, 0 to 2822
Data columns (total 25 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ORDERNUMBER       2823 non-null   int64
 1   QUANTITYORDERED   2823 non-null   int64
 2   PRICEEACH         2823 non-null   float64
 3   ORDERLINENUMBER   2823 non-null   int64
 4   SALES             2823 non-null   float64
 5   ORDERDATE         2823 non-null   object
 6   STATUS            2823 non-null   object
 7   QTR_ID            2823 non-null   int64
 8   MONTH_ID          2823 non-null   int64
 9   YEAR_ID           2823 non-null   int64
 10  PRODUCTLINE       2823 non-null   object
 11  MSRP              2823 non-null   int64
 12  PRODUCTCODE       2823 non-null   object
 13  CUSTOMERNAME      2823 non-null   object
 14  PHONE             2823 non-null   object
 15  ADDRESSLINE1      2823 non-null   object
 16  ADDRESSLINE2      302 non-null    object
 17  CITY              2823 non-null   object
 18  STATE             1337 non-null   object
 19  POSTALCODE        2747 non-null   object
 20  COUNTRY           2823 non-null   object
 21  TERRITORY         1749 non-null   object
 22  CONTACTLASTNAME   2823 non-null   object
 23  CONTACTFIRSTNAME  2823 non-null   object
 24  DEALSIZE          2823 non-null   object
dtypes: float64(2), int64(7), object(16)
memory usage: 551.5+ KB
None

In [ ]:
print(df.head(2))

   ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER   SALES  \
0        10107               30      95.70                2  2871.0
1        10121               34      81.35                5  2765.9

        ORDERDATE   STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
0  2/24/2003 0:00  Shipped       1         2     2003  ...
1   5/7/2003 0:00  Shipped       2         5     2003  ...

              ADDRESSLINE1  ADDRESSLINE2   CITY STATE POSTALCODE COUNTRY  \
0  897 Long Airport Avenue           NaN    NYC    NY      10022     USA
1       59 rue de l'Abbaye           NaN  Reims   NaN      51100  France

  TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
0       NaN              Yu             Kwai    Small
1      EMEA         Henriot             Paul    Small

[2 rows x 25 columns]

In [ ]:
print(df.tail(2))

      ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
2821        10397               34      62.24                1  2116.16
2822        10414               47      65.52                9  3079.44

           ORDERDATE   STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
2821  3/28/2005 0:00  Shipped       1         3     2005  ...
2822   5/6/2005 0:00  On Hold       2         5     2005  ...

               ADDRESSLINE1  ADDRESSLINE2      CITY STATE POSTALCODE COUNTRY  \
2821  1 rue Alsace-Lorraine           NaN  Toulouse   NaN      31000  France
2822     8616 Spinnaker Dr.           NaN    Boston    MA      51003     USA

     TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
2821      EMEA          Roulet          Annette    Small
2822       NaN         Yoshido             Juri   Medium

[2 rows x 25 columns]

In [ ]:
print(df.columns)

Index(['ORDERNUMBER', 'QUANTITYORDERED', 'PRICEEACH', 'ORDERLINENUMBER',
       'SALES', 'ORDERDATE', 'STATUS', 'QTR_ID', 'MONTH_ID', 'YEAR_ID',
       'PRODUCTLINE', 'MSRP', 'PRODUCTCODE', 'CUSTOMERNAME', 'PHONE',
       'ADDRESSLINE1', 'ADDRESSLINE2', 'CITY', 'STATE', 'POSTALCODE',
       'COUNTRY', 'TERRITORY', 'CONTACTLASTNAME', 'CONTACTFIRSTNAME',
       'DEALSIZE'],
      dtype='object')

In [ ]:
print(df.dtypes)

ORDERNUMBER           int64
QUANTITYORDERED       int64
PRICEEACH           float64
ORDERLINENUMBER       int64
SALES               float64
ORDERDATE            object
STATUS               object
QTR_ID                int64
MONTH_ID              int64
YEAR_ID               int64
PRODUCTLINE          object
MSRP                  int64
PRODUCTCODE          object
CUSTOMERNAME         object
PHONE                object
ADDRESSLINE1         object
ADDRESSLINE2         object
CITY                 object
STATE                object
POSTALCODE           object
COUNTRY              object
TERRITORY            object
CONTACTLASTNAME      object
CONTACTFIRSTNAME     object
DEALSIZE             object
dtype: object

In [ ]:
print(df.sample(5))

      ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
1815        10378               41     100.00                7  5856.85
2462        10167               43      75.34               12  3239.62
821         10308               34      52.09                3  1771.06
705         10141               47     100.00                8  6287.66
748         10367               27     100.00                5  4196.07

            ORDERDATE     STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
1815   2/10/2005 0:00    Shipped       1         2     2005  ...
2462  10/23/2003 0:00  Cancelled       4        10     2003  ...
821   10/15/2004 0:00    Shipped       4        10     2004  ...
705     8/1/2003 0:00    Shipped       3         8     2003  ...
748    1/12/2005 0:00   Resolved       1         1     2005  ...

                             ADDRESSLINE1  ADDRESSLINE2          CITY STATE  \
1815                   C/ Moralzarzal, 86           NaN        Madrid   NaN
2462                         ?kergatan 24           NaN         Boras   NaN
821             3758 North Pendale Street           NaN  White Plains    NY
705   Software Engineering Center, SEC Oy           NaN         Espoo   NaN
748                    78934 Hillside Dr.           NaN      Pasadena    CA

     POSTALCODE  COUNTRY TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
1815      28034    Spain      EMEA          Freyre            Diego   Medium
2462   S-844 67   Sweden      EMEA         Larsson            Maria   Medium
821       24067      USA       NaN           Frick            Steve    Small
705   FIN-02271  Finland      EMEA        Suominen            Kalle   Medium
748       90003      USA       NaN           Young            Julie   Medium

[5 rows x 25 columns]

In [ ]:
print(df.describe())

        ORDERNUMBER  QUANTITYORDERED    PRICEEACH  ORDERLINENUMBER  \
count   2823.000000      2823.000000  2823.000000      2823.000000
mean   10258.725115        35.092809    83.658544         6.466171
std       92.085478         9.741443    20.174277         4.225841
min    10100.000000         6.000000    26.880000         1.000000
25%    10180.000000        27.000000    68.860000         3.000000
50%    10262.000000        35.000000    95.700000         6.000000
75%    10333.500000        43.000000   100.000000         9.000000
max    10425.000000        97.000000   100.000000        18.000000

              SALES       QTR_ID     MONTH_ID     YEAR_ID         MSRP
count   2823.000000  2823.000000  2823.000000  2823.00000  2823.000000
mean    3553.889072     2.717676     7.092455  2003.81509   100.715551
std     1841.865106     1.203878     3.656633     0.69967    40.187912
min      482.130000     1.000000     1.000000  2003.00000    33.000000
25%     2203.430000     2.000000     4.000000  2003.00000    68.000000
50%     3184.800000     3.000000     8.000000  2004.00000    99.000000
75%     4508.000000     4.000000    11.000000  2004.00000   124.000000
max    14082.800000     4.000000    12.000000  2005.00000   214.000000

**Missing Values:**

df.isnull() - > Returns True where value is NaN

df.isnull().sum() ->Total missing values per column

df.dropna() -> Drops rows with missing values

df.fillna(value) -> Fills NaN with a value

df.fillna(method='ffill') -> Forward fill

df.fillna(method='bfill') -> Backward fill

In [ ]:
print(df.isnull())

      ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER  SALES  \
0           False            False      False            False  False
1           False            False      False            False  False
2           False            False      False            False  False
3           False            False      False            False  False
4           False            False      False            False  False
...           ...              ...        ...              ...    ...
2818        False            False      False            False  False
2819        False            False      False            False  False
2820        False            False      False            False  False
2821        False            False      False            False  False
2822        False            False      False            False  False

      ORDERDATE  STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  ADDRESSLINE1  \
0         False   False   False     False    False  ...         False
1         False   False   False     False    False  ...         False
2         False   False   False     False    False  ...         False
3         False   False   False     False    False  ...         False
4         False   False   False     False    False  ...         False
...         ...     ...     ...       ...      ...  ...           ...
2818      False   False   False     False    False  ...         False
2819      False   False   False     False    False  ...         False
2820      False   False   False     False    False  ...         False
2821      False   False   False     False    False  ...         False
2822      False   False   False     False    False  ...         False

      ADDRESSLINE2   CITY  STATE  POSTALCODE  COUNTRY  TERRITORY  \
0             True  False  False       False    False       True
1             True  False   True       False    False      False
2             True  False   True       False    False      False
3             True  False  False       False    False       True
4             True  False  False        True    False       True
...            ...    ...    ...         ...      ...        ...
2818          True  False   True       False    False      False
2819          True  False   True       False    False      False
2820          True  False   True       False    False      False
2821          True  False   True       False    False      False
2822          True  False  False       False    False       True

      CONTACTLASTNAME  CONTACTFIRSTNAME  DEALSIZE
0               False             False     False
1               False             False     False
2               False             False     False
3               False             False     False
4               False             False     False
...               ...               ...       ...
2818            False             False     False
2819            False             False     False
2820            False             False     False
2821            False             False     False
2822            False             False     False

[2823 rows x 25 columns]

In [ ]:
print(df.isnull().sum())

ORDERNUMBER            0
QUANTITYORDERED        0
PRICEEACH              0
ORDERLINENUMBER        0
SALES                  0
ORDERDATE              0
STATUS                 0
QTR_ID                 0
MONTH_ID               0
YEAR_ID                0
PRODUCTLINE            0
MSRP                   0
PRODUCTCODE            0
CUSTOMERNAME           0
PHONE                  0
ADDRESSLINE1           0
ADDRESSLINE2        2521
CITY                   0
STATE               1486
POSTALCODE            76
COUNTRY                0
TERRITORY           1074
CONTACTLASTNAME        0
CONTACTFIRSTNAME       0
DEALSIZE               0
dtype: int64

In [ ]:
df.fillna(value = 0)

NameError: name 'df' is not defined

**🔃 Sorting Data in Pandas**

Function	Description

df.sort_values(by='column_name'): Sorts the DataFrame by a specific column in ascending order.

df.sort_values(by='column_name', ascending=False): Sorts the DataFrame in descending order.

df.sort_values(by=['col1', 'col2']): Sorts by multiple columns (e.g., first by col1, then by col2).

df.sort_index(): Sorts the DataFrame by the index.

df.sort_index(ascending=False): Sorts the index in descending order.

df.sort_values(by='column_name', ascending=True, inplace=True)

In [ ]:
print(df.columns)
df.sort_values(by='DEALSIZE', ascending=True, inplace=False)

Index(['ORDERNUMBER', 'QUANTITYORDERED', 'PRICEEACH', 'ORDERLINENUMBER',
       'SALES', 'ORDERDATE', 'STATUS', 'QTR_ID', 'MONTH_ID', 'YEAR_ID',
       'PRODUCTLINE', 'MSRP', 'PRODUCTCODE', 'CUSTOMERNAME', 'PHONE',
       'ADDRESSLINE1', 'ADDRESSLINE2', 'CITY', 'STATE', 'POSTALCODE',
       'COUNTRY', 'TERRITORY', 'CONTACTLASTNAME', 'CONTACTFIRSTNAME',
       'DEALSIZE'],
      dtype='object')

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
319,10142,46,100.0,11,9470.94,8/8/2003 0:00,Shipped,3,8,2003,...,5677 Strong St.,NaN,San Rafael,CA,97562,USA,NaN,Nelson,Valarie,Large
252,10251,46,100.0,1,7552.28,5/18/2004 0:00,Shipped,2,5,2004,...,7476 Moss Rd.,NaN,Newark,NJ,94019,USA,NaN,Brown,William,Large
1384,10299,49,100.0,2,7947.31,9/30/2004 0:00,Shipped,3,9,2004,...,Keskuskatu 45,NaN,Helsinki,NaN,21240,Finland,EMEA,Karttunen,Matti,Large
131,10400,64,100.0,9,9661.44,4/1/2005 0:00,Shipped,2,4,2005,...,3086 Ingle Ln.,NaN,San Jose,CA,94217,USA,NaN,Frick,Sue,Large
447,10424,54,100.0,5,7182.00,5/31/2005 0:00,In Process,2,5,2005,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Large
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
538,10241,21,100.0,11,2508.66,4/13/2004 0:00,Shipped,2,4,2004,...,"24, place Kluber",NaN,Strasbourg,NaN,67000,France,EMEA,Citeaux,Frederique,Small
1709,10321,30,72.7,1,2181.00,11/4/2004 0:00,Shipped,4,11,2004,...,1785 First Street,NaN,New Bedford,MA,50553,USA,NaN,Benitez,Violeta,Small
1708,10311,28,93.6,4,2620.80,10/16/2004 0:00,Shipped,4,10,2004,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Small
1527,10284,22,100.0,3,2310.88,8/21/2004 0:00,Shipped,3,8,2004,...,"Drammensveien 126 A, PB 744 Sentrum",NaN,Oslo,NaN,N 0106,Norway,EMEA,Klaeboe,Jan,Small
0,10107,30,95.7,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small

**🔎 Selecting Rows by Filtering & Multiple Conditions**

**✅ Basic Filtering**

df[df['column'] > 50]

➡️ Returns rows where 'column' is greater than 50.

**✅ Using Multiple Conditions**

df[(df['age'] > 25) & (df['gender'] == 'Male')]

➡️ Rows where age > 25 AND gender is 'Male'.

df[(df['age'] < 18) | (df['city'] == 'Lahore')]

➡️ Rows where age < 18 OR city is 'Lahore'.

🧠 Use & for AND, | for OR, and wrap each condition in parentheses ().

**✅ Negation**

df[~(df['status'] == 'Inactive')]

syntax

column = df["column name"]

subset = df[["Column1","Column2","...."]]

filtered_rows = df[df["column_name"] > value ]

filtered_row = df[(df["column1"] > value1 ) & (df["column2"]=="value2")]

In [ ]:
# syntax
# column = df["column name"]
# subset = df[["Column1","Column2","...."]]
# filtered_rows = df[df["column_name"] > 50 ]
# filtered_row = df[(df["salary"] > 50000 ) & (df["city"]=="lahore")]

In [ ]:
import pandas as pd
data = {
    "Name":['Kinza','Sara','Jim'],
    "Age":[24,22,26],
    "City":['Lahore','Karachi','Islamabad'],
    "Salary":[50000,60000,70000]
}
df = pd.DataFrame(data)
print(df)
print(df["Name"])
# or name = df["Name"]
# print(name)
print(df["Salary"])

# selecting multiple columns
subset = df[["Name","City"]]
print(subset)

    Name  Age       City  Salary
0  Kinza   24     Lahore   50000
1   Sara   22    Karachi   60000
2    Jim   26  Islamabad   70000
0    Kinza
1     Sara
2      Jim
Name: Name, dtype: object
0    50000
1    60000
2    70000
Name: Salary, dtype: int64
    Name       City
0  Kinza     Lahore
1   Sara    Karachi
2    Jim  Islamabad

In [ ]:
high_salary = df[df["Salary"] > 50000]
print("People with salary greater than 50k:\n",high_salary)

mul_cond = df[(df["Salary"] > 50000) & (df["Age"] > 24)]
print("People with salary greater than 50k and age greater than 24:\n",mul_cond)


mul_cond = df[(df["Salary"] > 50000) | (df["Age"] > 24)]
print("People with salary greater than 50k or age greater than 24:\n",mul_cond)

People with salary greater than 50k:
    Name  Age       City  Salary
1  Sara   22    Karachi   60000
2   Jim   26  Islamabad   70000
People with salary greater than 50k and age greater than 24:
   Name  Age       City  Salary
2  Jim   26  Islamabad   70000
People with salary greater than 50k or age greater than 24:
    Name  Age       City  Salary
1  Sara   22    Karachi   60000
2   Jim   26  Islamabad   70000

**Inserting new Column:**

df["Column_Name"] = Some_data   

or

df.insert(loc, "Column_Name", some_data)

In [ ]:
df["Bonus"] = df["Salary"] * 0.1
print(df["Bonus"])
print(df)

0    5000.0
1    6000.0
2    7000.0
Name: Bonus, dtype: float64
    Name  Age       City  Salary   Bonus
0  Kinza   24     Lahore   50000  5000.0
1   Sara   22    Karachi   60000  6000.0
2    Jim   26  Islamabad   70000  7000.0

In [ ]:
df.insert(0,"Employee_ID",[1,2,3])
print(df)

   Employee_ID  Employee ID   Name  Age       City  Salary   Bonus
0            1            1  Kinza   24     Lahore   50000  5000.0
1            2            2   Sara   22    Karachi   60000  6000.0
2            3            3    Jim   26  Islamabad   70000  7000.0

**df.loc[row_index]:** Used to access an index.   
**df.loc[row_index,"Column_Name"] = new_value**

df.loc[2]
→ Returns the row with index 2.

df.loc[2, "Age"] = 30
→ Sets the value 30 in the "Age" column of the row with index 2.

**df.iloc[row_index,column_index]**

df.iloc[2,1]
→ Returns the value in 3rd row and 2nd column.

df.iloc[2,1] = 50
→ Updates the value in 3rd row and 2nd column to 50.

In [ ]:
print(df.loc[0])
print(df.loc[1])
# prints only name of index 2
print(df.loc[2,"Name"])
df.loc[2,"Name"] = "Tom"
print(df.loc[2,"Name"])

Employee_ID         1
Employee ID         1
Name            Kinza
Age                24
City           Lahore
Salary          50000
Bonus          5000.0
Name: 0, dtype: object
Employee_ID          2
Employee ID          2
Name              Sara
Age                 22
City           Karachi
Salary           60000
Bonus           6000.0
Name: 1, dtype: object
Jim
Tom

In [ ]:
print(df.iloc[2,1])
print(df.iloc[0,4])

3
Lahore

**Updating value of a column:**

df["Salary] = df["Salary"] *1.05 --> Increasing salary by 5%.

In [ ]:
df["Salary"] = df["Salary"] * 1.05
print(df)

   Employee_ID  Employee ID   Name  Age       City   Salary   Bonus
0            1            1  Kinza   24     Lahore  52500.0  5000.0
1            2            2   Sara   22    Karachi  63000.0  6000.0
2            3            3    Tom   26  Islamabad  73500.0  7000.0

df = pd.DataFrame(data, index=['a', 'b', 'c'])

➤ Correct way to assign custom row labels.

df.loc['a']

➤ Accesses the row where the index is 'a'.

In [ ]:
data = {
    "Name":['Kinza','Sara','Jim'],
    "Age":[24,22,26],
    "City":['Lahore','Karachi','Islamabad'],
    "Salary":[50000,60000,70000]
}
df = pd.DataFrame(data,index = ['a','b','c'])
print(df)

print(df.loc['a'])

    Name  Age       City  Salary
a  Kinza   24     Lahore   50000
b   Sara   22    Karachi   60000
c    Jim   26  Islamabad   70000
Name       Kinza
Age           24
City      Lahore
Salary     50000
Name: a, dtype: object

**Deleting column:**

df = df.drop('Column_Name', axis=1)

In [ ]:
data = {
    "Name":['Kinza','Sara','Jim'],
    "Age":[24,22,26],
    "City":['Lahore','Karachi','Islamabad'],
    "Salary":[50000,60000,70000]
}
df = pd.DataFrame(data)
print(df)
df = df.drop("Age",axis=1)
print(df)

    Name  Age       City  Salary
0  Kinza   24     Lahore   50000
1   Sara   22    Karachi   60000
2    Jim   26  Islamabad   70000
    Name       City  Salary
0  Kinza     Lahore   50000
1   Sara    Karachi   60000
2    Jim  Islamabad   70000

**Missing Values:**

NaN stands for Not a Number.

It is used in Pandas and NumPy to represent missing or undefined values in a dataset.


**🔹 What does df.isnull() return?**

It returns a DataFrame of booleans:

True where the value is NaN (missing),

False where the value is present.


**🔹 What does df.isnull().sum() do?**

It gives the count of missing values per column.

Useful for checking how many values are missing.

**🔹 What is Forward Fill (ffill)?**

Fills NaN values with the previous (above) non-null value.

**🔹 What is Backward Fill (bfill)?**

Fills NaN values with the next (below) non-null value.

df.isnull() - > Returns True where value is NaN

df.isnull().sum() ->Total missing values per column

df.dropna() -> Drops rows with missing values

df.fillna(value) -> Fills NaN with a value

df.fillna(method='ffill') -> Forward fill

df.fillna(method='bfill') -> Backward fill

In [ ]:
import numpy as np
import pandas as pd
data = {
    "Age": [25,np.nan,30]
}
df = pd.DataFrame(data)
print(df)

print(df.fillna(method = "ffill"))
print(df.fillna(method = "bfill"))

print(df.dropna())

data = {
    "Age": [25,np.nan,30]
}
df = pd.DataFrame(data)
print(df)
print(df.fillna(value=np.mean(df["Age"])))
# or
print(df.fillna(df['Age'].mean()))

    Age
0  25.0
1   NaN
2  30.0
    Age
0  25.0
1  25.0
2  30.0
    Age
0  25.0
1  30.0
2  30.0
    Age
0  25.0
2  30.0
    Age
0  25.0
1   NaN
2  30.0
    Age
0  25.0
1  27.5
2  30.0
    Age
0  25.0
1  27.5
2  30.0

/tmp/ipython-input-47-624726775.py:9: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method = "ffill"))
/tmp/ipython-input-47-624726775.py:10: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method = "bfill"))

**🔹 What is Interpolation?**

Interpolation is a technique used to fill missing values (NaN) by estimating them based on other values in the data. Instead of using fixed values like forward fill or mean, interpolation uses trends or patterns in the data to estimate the missing ones.

**df.interpolate(method='linear')**

Default method is 'linear', which means the missing value is calculated assuming a straight line between the known values.

Only works on numerical columns.

**🔹 Linear Interpolation – How it works:**

If a value is missing between two known points, it estimates the value by drawing a straight line between those two points and picking the value at the missing point.

In [ ]:
import numpy as np
import pandas as pd

data = {
    "Age": [25, np.nan, np.nan, 40]
}
df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)

# Interpolate missing values
print("\nAfter Linear Interpolation:")
print(df.interpolate(method='linear'))

Original DataFrame:
    Age
0  25.0
1   NaN
2   NaN
3  40.0

After Linear Interpolation:
    Age
0  25.0
1  30.0
2  35.0
3  40.0

**⚖️ Comparison Summary:**

Method  Best for & Shape of Fit

**linear:** Simple trends, steady change

Straight lines

**polynomial:** Curved trends, accelerating changes

Curved (degree N)

**time:** Date-time indexed irregular data  

Linear, time-aware

**Syntax:**

**df['Value'] = df['Value'].interpolate(method='linear')**

**df['Value'] = df['Value'].interpolate(method='polynomial', order=2)**

df['Time'] = pd.date_range("2023-01-01", periods=5, freq='D')

df.set_index('Time', inplace=True)

Introduce NaN manually (for clarity)

df.loc[df.index[3], 'Value'] = np.nan

Apply time-based interpolation

**df['Value'] = df['Value'].interpolate(method='time')**

In [ ]:
import pandas as pd
import numpy as np
data = {
    "Time": [1,2,3,4,5],
     "Value": [1.8,2.2,3,np.nan,5]
}
df = pd.DataFrame(data)
print(df)
df['Value'] = df['Value'].interpolate(method= "linear")
print(df)

   Time  Value
0     1    1.8
1     2    2.2
2     3    3.0
3     4    NaN
4     5    5.0
   Time  Value
0     1    1.8
1     2    2.2
2     3    3.0
3     4    4.0
4     5    5.0

**Sorting and Aggregation:**

df.sort_values(by='column_name',ascending= True/False, in place= True)

df.sort_values(by= ['Column1','Column2'],ascending=[True/False,True/False],inplace= True)

In [ ]:
data = {
    "Name": ["Ali", "Sara", "John", "Fatima", "David", "Ayesha"],
    "Age": [25, 22, 28, 21, 30, 24],
    "City": ["Lahore", "Karachi", "Islamabad", "Lahore", "Karachi", "Multan"],
    "Gender": ["Male", "Female", "Male", "Female", "Male", "Female"],
    "Marks": [12,14,15,10,9,20]
}
df= pd.DataFrame(data)
print(df)
#in ascending order
print(df.sort_values(by="Age",ascending=True,inplace=False))
# in descending order
print(df.sort_values(by="Age",ascending=False,inplace=False))

df.sort_values(by= ['Age','Marks'],ascending=[True,True],inplace=True)
print(df)

     Name  Age       City  Gender  Marks
0     Ali   25     Lahore    Male     12
1    Sara   22    Karachi  Female     14
2    John   28  Islamabad    Male     15
3  Fatima   21     Lahore  Female     10
4   David   30    Karachi    Male      9
5  Ayesha   24     Multan  Female     20
     Name  Age       City  Gender  Marks
3  Fatima   21     Lahore  Female     10
1    Sara   22    Karachi  Female     14
5  Ayesha   24     Multan  Female     20
0     Ali   25     Lahore    Male     12
2    John   28  Islamabad    Male     15
4   David   30    Karachi    Male      9
     Name  Age       City  Gender  Marks
4   David   30    Karachi    Male      9
2    John   28  Islamabad    Male     15
0     Ali   25     Lahore    Male     12
5  Ayesha   24     Multan  Female     20
1    Sara   22    Karachi  Female     14
3  Fatima   21     Lahore  Female     10
     Name  Age       City  Gender  Marks
3  Fatima   21     Lahore  Female     10
1    Sara   22    Karachi  Female     14
5  Ayesha   24     Multan  Female     20
0     Ali   25     Lahore    Male     12
2    John   28  Islamabad    Male     15
4   David   30    Karachi    Male      9

**Summary Statistics of a column:**

df["Column_Name"].mean()

df["Column_Name"].sum()

df["Column_Name"].min()

df["Column_Name"].max()

In [ ]:
data = {
    "Name": ["Ali", "Sara", "John", "Fatima", "David", "Ayesha"],
    "Age": [25, 22, 28, 21, 30, 24],
    "City": ["Lahore", "Karachi", "Islamabad", "Lahore", "Karachi", "Multan"],
    "Gender": ["Male", "Female", "Male", "Female", "Male", "Female"],
    "Marks": [12,14,15,10,9,20]
}
df= pd.DataFrame(data)
print(df)

avg_marks = df["Marks"].mean()
print(avg_marks)

Sum = df["Marks"].sum()
print(Sum)

Min = df["Marks"].min()
print(Min)

Max = df["Marks"].max()
print(Max)

     Name  Age       City  Gender  Marks
0     Ali   25     Lahore    Male     12
1    Sara   22    Karachi  Female     14
2    John   28  Islamabad    Male     15
3  Fatima   21     Lahore  Female     10
4   David   30    Karachi    Male      9
5  Ayesha   24     Multan  Female     20
13.333333333333334
80
9
20

**Group-by:**

df.groupby('column_to_group_by')['column_to_aggregate'].aggregation_function()

**Some common Aggregation Functions:**

sum()

mean()

count()

min()

max()

std()

In [ ]:
import pandas as pd

data = {
    "Name": ["Ali", "Sara", "John", "Fatima", "David", "Ayesha"],
    "Age": [25, 22, 28, 21, 22, 24],
    "City": ["Lahore", "Karachi", "Islamabad", "Lahore", "Karachi", "Multan"],
    "Gender": ["Male", "Female", "Male", "Female", "Male", "Female"],
    "Salary": [50000,60000,70000,40000,35000,60000]
}

df = pd.DataFrame(data)

grouped_bygender= df.groupby("Gender")["Salary"].sum()
print(grouped_bygender)

grouped_byage= df.groupby("Age")["Salary"].sum()
print(grouped_byage)

grouped_byagename= df.groupby(["Age","Name"])["Salary"].sum()
print(grouped_byagename)

grouped_byagg = df.groupby("Age").agg(
    {
        "Salary": ["sum","mean"],
        "Name": "count"
    })
print(grouped_byagg)

Gender
Female    160000
Male      155000
Name: Salary, dtype: int64
Age
21    40000
22    95000
24    60000
25    50000
28    70000
Name: Salary, dtype: int64
Age  Name
21   Fatima    40000
22   David     35000
     Sara      60000
24   Ayesha    60000
25   Ali       50000
28   John      70000
Name: Salary, dtype: int64
    Salary           Name
       sum     mean count
Age
21   40000  40000.0     1
22   95000  47500.0     2
24   60000  60000.0     1
25   50000  50000.0     1
28   70000  70000.0     1

**Merging and Joining:**

pd.merge(df1, df2, on='id', how='inner')  # only matched rows

pd.merge(df1, df2, on='id', how='left')   # all df1 + matched df2

pd.merge(df1, df2, on='id', how='right')  # all df2 + matched df1

pd.merge(df1, df2, on='id', how='outer')  # all rows, fill unmatched with NaN

| Join Type | Keeps All From     | Matches From       | Fills Missing With |
| --------- | ------------------ | ------------------ | ------------------ |
| `inner`   | Only matches       | Both               | —                  |
| `outer`   | Both               | Both               | `NaN`              |
| `left`    | Left (`customers`) | Right (`orders`)   | `NaN`              |
| `right`   | Right (`orders`)   | Left (`customers`) | `NaN`              |


**🔷 What is a Cross Join?**

A cross join (also known as a Cartesian product) is a type of join that returns all possible combinations of rows from two tables (or DataFrames).

If one table has M rows and the other has N rows, the result will have M × N rows.

It does not require any common column or matching condition between the tables.

In [ ]:
import pandas as pd
df_customers = pd.DataFrame({
           "Customer_ID": [1,2,3],
           "Name": ["Kinza","Joe","Jim"]
      })
print(df_customers)

df_orders = pd.DataFrame({
           "Customer_ID": [1,2,4],
           "Order Amount": [150,280,350]
      })
print(df_orders)

df_merged = pd.merge(df_customers,df_orders, on = "Customer_ID",how = "inner")
print("Inner join:")
print(df_merged)

df_merged = pd.merge(df_customers,df_orders, on = "Customer_ID",how = "outer")
print("Outer join:")
print(df_merged)

df_merged = pd.merge(df_customers,df_orders, on = "Customer_ID",how = "left")
print("Left join:")
print(df_merged)

df_merged = pd.merge(df_customers,df_orders, on = "Customer_ID",how = "right")
print("Right join:")
print(df_merged)

df_merged = df_customers.merge(df_orders,how = "cross")
print("Cross join:")
print(df_merged)

   Customer_ID   Name
0            1  Kinza
1            2    Joe
2            3    Jim
   Customer_ID  Order Amount
0            1           150
1            2           280
2            4           350
Inner join:
   Customer_ID   Name  Order Amount
0            1  Kinza           150
1            2    Joe           280
Outer join:
   Customer_ID   Name  Order Amount
0            1  Kinza         150.0
1            2    Joe         280.0
2            3    Jim           NaN
3            4    NaN         350.0
Left join:
   Customer_ID   Name  Order Amount
0            1  Kinza         150.0
1            2    Joe         280.0
2            3    Jim           NaN
Right join:
   Customer_ID   Name  Order Amount
0            1  Kinza           150
1            2    Joe           280
2            4    NaN           350
Cross join:
   Customer_ID_x   Name  Customer_ID_y  Order Amount
0              1  Kinza              1           150
1              1  Kinza              2           280
2              1  Kinza              4           350
3              2    Joe              1           150
4              2    Joe              2           280
5              2    Joe              4           350
6              3    Jim              1           150
7              3    Jim              2           280
8              3    Jim              4           350

**Concatenate:**

**🔷 What is pd.concat()?**

The pd.concat() function in pandas is used to combine multiple DataFrames either:

Vertically (one on top of the other): axis=0

Horizontally (side by side): axis=1

**pd.concat([df1, df2], axis=0 or 1)**

In [ ]:
import pandas as pd

df1 = pd.DataFrame({
'A': [1, 2]
})

df2 = pd.DataFrame({
'A': [3, 4]
})

# vertically
result = pd.concat([df1, df2], axis=0)
print(result)

# horizontally
result = pd.concat([df1, df2], axis=1)
print(result)

   A
0  1
1  2
0  3
1  4
   A  A
0  1  3
1  2  4

**🔷 df.drop_duplicates()**

This function removes duplicate rows from a DataFrame.

| Parameter      | Description                             |
| -------------- | --------------------------------------- |
| `subset`       | Specify columns to check for duplicates |
| `keep='first'` | Keep the **first** occurrence (default) |
| `keep='last'`  | Keep the **last** occurrence            |
| `keep=False`   | Drop **all** duplicates                 |
| `inplace=True` | Modify the original DataFrame           |

In [ ]:
import pandas as pd

df = pd.DataFrame({
    'Name': ['Ali', 'Kinza', 'Ali', 'Sara'],
    'Age': [25, 22, 25, 30]
})

print("Original:")
print(df)

# Remove duplicates
df_unique = df.drop_duplicates()
print("\nAfter Removing Duplicates:")
print(df_unique)

Original:
    Name  Age
0    Ali   25
1  Kinza   22
2    Ali   25
3   Sara   30

After Removing Duplicates:
    Name  Age
0    Ali   25
1  Kinza   22
3   Sara   30

In [ ]:
import pandas as pd

df = pd.DataFrame({
    'Name': ['Ali', 'Kinza', 'Ali', 'Sara'],
    'Age': [25, 22, 27, 30]
})

print("Original:")
print(df)

df_unique= df.drop_duplicates(subset=['Name'], keep='first')
print(df_unique)

Original:
    Name  Age
0    Ali   25
1  Kinza   22
2    Ali   27
3   Sara   30
    Name  Age
0    Ali   25
1  Kinza   22
3   Sara   30

In [ ]:
import pandas as pd

df = pd.DataFrame({
    'Name': ['Ali', 'Kinza', 'Ali', 'Sara'],
    'Age': [25, 22, 27, 30]
})

print("Original:")
print(df)

df_unique= df.drop_duplicates(subset=['Name'], keep='last')
print(df_unique)

Original:
    Name  Age
0    Ali   25
1  Kinza   22
2    Ali   27
3   Sara   30
    Name  Age
1  Kinza   22
2    Ali   27
3   Sara   30

**apply & lambda function:**

✅ Using .apply() with a Series (Single Column)

In [ ]:
import pandas as pd

df = pd.DataFrame({
    'Marks': [80, 60, 90]
})

# Apply a lambda to multiply each mark by 2
df['Double'] = df['Marks'].apply(lambda x: x * 2)
print(df)
df['Grade'] = df['Marks'].apply(lambda x: 'A' if x >= 70 else 'B')
print(df)

   Marks  Double
0     80     160
1     60     120
2     90     180
   Marks  Double Grade
0     80     160     A
1     60     120     B
2     90     180     A

✅ Using .apply() on Rows or Columns of a DataFrame:

You can use .apply() on the full DataFrame, and set the axis:

axis=0 → apply to columns

axis=1 → apply to rows

In [ ]:
df = pd.DataFrame({
    'Math': [80, 60, 90],
    'Science': [85, 75, 95]
})

# Row-wise total using lambda (sum of marks)
df['Total'] = df.apply(lambda row: row['Math'] + row['Science'], axis=1)
print(df)

   Math  Science  Total
0    80       85    165
1    60       75    135
2    90       95    185

In [ ]:
import pandas as pd
data = {
    "Name": ["Ali", "Sara", "John", "Fatima", "David", "Ayesha"],
    "Age": [25, 22, 28, 21, 30, 24],
    "City": ["Lahore", "Karachi", "Islamabad", "Lahore", "Karachi", "Multan"],
    "Gender": ["Male", "Female", "Male", "Female", "Male", "Female"],
    "Salary": [50000,60000,70000,40000,35000,60000],
    "Department": ["CS","MT","CS","EE","CS","HR"]
}

df= pd.DataFrame(data)
print(df)

df["Age Group"] = pd.cut(df["Age"], bins = [0,25,29,100],labels = ["Young","Middle-Aged","Old"])
print(df)

     Name  Age       City  Gender  Salary Department
0     Ali   25     Lahore    Male   50000         CS
1    Sara   22    Karachi  Female   60000         MT
2    John   28  Islamabad    Male   70000         CS
3  Fatima   21     Lahore  Female   40000         EE
4   David   30    Karachi    Male   35000         CS
5  Ayesha   24     Multan  Female   60000         HR
     Name  Age       City  Gender  Salary Department    Age Group
0     Ali   25     Lahore    Male   50000         CS        Young
1    Sara   22    Karachi  Female   60000         MT        Young
2    John   28  Islamabad    Male   70000         CS  Middle-Aged
3  Fatima   21     Lahore  Female   40000         EE        Young
4   David   30    Karachi    Male   35000         CS          Old
5  Ayesha   24     Multan  Female   60000         HR        Young

**Join with suffixes:**

In [ ]:
import pandas as pd
# First DataFrame
df1 = pd.DataFrame({
    'ID': [1, 2],
    'Name': ['Ali', 'Zara'],
    'City': ['Lahore', 'Karachi']
})
# Second DataFrame
df2 = pd.DataFrame({
    'ID': [1, 2],
    'Name': ['Ahmed', 'Sara'],
    'City': ['Multan', 'Islamabad']
})
# Merge with suffixes
merged_df = pd.merge(df1, df2, on='ID', suffixes=('_left', '_right'))
print(merged_df)

   ID Name_left City_left Name_right City_right
0   1       Ali    Lahore      Ahmed     Multan
1   2      Zara   Karachi       Sara  Islamabad

**Mini Project:**

Create a Pandas Series from seeing the Python_Score column.

Display the mean Python score using the Series.

Load the project_scores.csv file into a DataFrame.

Show only the first 3 rows of the DataFrame.

Show only the Name and ML_Score columns.

Add a new column called Total_Score which is the sum of Python, ML, and AI scores for each student.

Replace all missing (NaN) scores with 0.

Add a column Result with value:

'Pass' if Total_Score ≥ 240

'Fail' otherwise

Display only students from the CS department who passed.

Sort the DataFrame by Total_Score in descending order.

Save the final cleaned DataFrame to a new file called final_results.csv.

In [ ]:
import pandas as pd

df= pd.read_excel("/content/project_scores.xlsx")
print(df)

python_series = df["Python_Score"]
pythonscore_mean = df["Python_Score"].mean()
print("The mean is:")
print(pythonscore_mean)

print("The first 3 rows of the Data frame:")
print(df.head(3))

print(df[["Name","ML_Score"]])

df["Total_Score"] = df["Python_Score"]+ df["ML_Score"] + df["AI_Score"]
print("Added new column Total_Score")
print(df)

print(df.isnull().sum())
print("Filled NaN with value= 0")
df.fillna(value=0,inplace=True)
print(df)

print("Added the Result column:")
df["Result"] = df["Total_Score"].apply(lambda x: "Pass" if x>=240 else "Fail")
print(df)

cs_students= df[(df["Department"] == "CS") & (df["Result"] == "Pass")]
print(cs_students)

df.sort_values(by="Total_Score",ascending=False,inplace=True)
print("Sorted in descending order by Total_Score column:")
print(df)

df.to_csv("final_results.csv")
print("Saved the cleaned Data Frame into final_results.csv file")

    ID    Name Department  Age  Python_Score  ML_Score  AI_Score
0  101  Ayesha         CS   21          85.0      90.0       NaN
1  102     Ali         IT   22          78.0       NaN      88.0
2  103    Sara         CS   20          92.0      95.0      94.0
3  104    John         SE   23           NaN      88.0      84.0
4  105    Omer         CS   24          69.0      75.0      72.0
The mean is:
81.0
The first 3 rows of the Data frame:
    ID    Name Department  Age  Python_Score  ML_Score  AI_Score
0  101  Ayesha         CS   21          85.0      90.0       NaN
1  102     Ali         IT   22          78.0       NaN      88.0
2  103    Sara         CS   20          92.0      95.0      94.0
     Name  ML_Score
0  Ayesha      90.0
1     Ali       NaN
2    Sara      95.0
3    John      88.0
4    Omer      75.0
Added new column Total_Score
    ID    Name Department  Age  Python_Score  ML_Score  AI_Score  Total_Score
0  101  Ayesha         CS   21          85.0      90.0       NaN          NaN
1  102     Ali         IT   22          78.0       NaN      88.0          NaN
2  103    Sara         CS   20          92.0      95.0      94.0        281.0
3  104    John         SE   23           NaN      88.0      84.0          NaN
4  105    Omer         CS   24          69.0      75.0      72.0        216.0
ID              0
Name            0
Department      0
Age             0
Python_Score    1
ML_Score        1
AI_Score        1
Total_Score     3
dtype: int64
Filled NaN with value= 0
    ID    Name Department  Age  Python_Score  ML_Score  AI_Score  Total_Score
0  101  Ayesha         CS   21          85.0      90.0       0.0          0.0
1  102     Ali         IT   22          78.0       0.0      88.0          0.0
2  103    Sara         CS   20          92.0      95.0      94.0        281.0
3  104    John         SE   23           0.0      88.0      84.0          0.0
4  105    Omer         CS   24          69.0      75.0      72.0        216.0
Added the Result column:
    ID    Name Department  Age  Python_Score  ML_Score  AI_Score  Total_Score  \
0  101  Ayesha         CS   21          85.0      90.0       0.0          0.0
1  102     Ali         IT   22          78.0       0.0      88.0          0.0
2  103    Sara         CS   20          92.0      95.0      94.0        281.0
3  104    John         SE   23           0.0      88.0      84.0          0.0
4  105    Omer         CS   24          69.0      75.0      72.0        216.0

  Result
0   Fail
1   Fail
2   Pass
3   Fail
4   Fail
    ID  Name Department  Age  Python_Score  ML_Score  AI_Score  Total_Score  \
2  103  Sara         CS   20          92.0      95.0      94.0        281.0

  Result
2   Pass
Sorted in descending order by Total_Score column:
    ID    Name Department  Age  Python_Score  ML_Score  AI_Score  Total_Score  \
2  103    Sara         CS   20          92.0      95.0      94.0        281.0
4  105    Omer         CS   24          69.0      75.0      72.0        216.0
0  101  Ayesha         CS   21          85.0      90.0       0.0          0.0
1  102     Ali         IT   22          78.0       0.0      88.0          0.0
3  104    John         SE   23           0.0      88.0      84.0          0.0

  Result
2   Pass
4   Fail
0   Fail
1   Fail
3   Fail
Saved the cleaned Data Frame into final_results.csv file

# ML WEEK-02 DAY-04 + DAY -05

**✅ pivot()**

Used when your data is already clean and there's no duplication in the index/column combinations.

It does not allow aggregation, and will throw an error if duplicate entries are found.

For this example:

**🔹 index**
Think of this as the rows in your new table.

Each unique value in the index column(s) becomes a row label.

✅ Example:
If you use index="Department" → each department gets its own row.

**🔹 columns**
These are the column headers in your pivoted table.

Each unique value in the columns field becomes a new column.

✅ Example:
If you use columns="Gender" → you'll get separate columns for "Male" and "Female".

**🔹 values**
These fill the cells of the pivoted table.

It’s the data you want to summarize or display.

✅ Example:
If you use values="Salary" → the actual salary numbers are placed in the table.

| Feature        | Value                         |
| -------------- | ----------------------------- |
| Function       | `pd.pivot()`                  |
| Purpose        | Reshape data (no aggregation) |
| Rows (`index`) | Department                    |
| Columns        | Gender                        |
| Values         | Salary                        |
| Output         | Salary values in table format |
| Limitation     | Fails if duplicates exist     |

In [ ]:
import pandas as pd
data = {
    "Name": ["Ali", "Sara", "John", "Fatima", "David", "Ayesha"],
    "Age": [25, 22, 28, 21, 30, 24],
    "City": ["Lahore", "Karachi", "Islamabad", "Paris", "New York", "Multan"],
    "Gender": ["Male", "Female", "Male", "Female", "Male", "Female"],
    "Salary": [50000,60000,70000,40000,35000,60000],
    "Department": ["CS","MT","AI","EE","DS","HR"]
}
df = pd.DataFrame(data)
print(df)

basic_pivot1 = pd.pivot(df,index="Department",columns="Gender",values="Salary")
print(basic_pivot1)

basic_pivot2 = pd.pivot(df,index="City",columns="Department",values="Salary")
print(basic_pivot2)

     Name  Age       City  Gender  Salary Department
0     Ali   25     Lahore    Male   50000         CS
1    Sara   22    Karachi  Female   60000         MT
2    John   28  Islamabad    Male   70000         AI
3  Fatima   21      Paris  Female   40000         EE
4   David   30   New York    Male   35000         DS
5  Ayesha   24     Multan  Female   60000         HR
Gender       Female     Male
Department
AI              NaN  70000.0
CS              NaN  50000.0
DS              NaN  35000.0
EE          40000.0      NaN
HR          60000.0      NaN
MT          60000.0      NaN
Department       AI       CS       DS       EE       HR       MT
City
Islamabad   70000.0      NaN      NaN      NaN      NaN      NaN
Karachi         NaN      NaN      NaN      NaN      NaN  60000.0
Lahore          NaN  50000.0      NaN      NaN      NaN      NaN
Multan          NaN      NaN      NaN      NaN  60000.0      NaN
New York        NaN      NaN  35000.0      NaN      NaN      NaN
Paris           NaN      NaN      NaN  40000.0      NaN      NaN

**🔷 What is a Pivot Table?**

A pivot table in pandas helps you summarize and analyze your data, especially when it's long format (rows contain repeated values).

Unlike pivot(), pivot_table():

✅ Handles duplicates

✅ Supports aggregation (like sum, mean, count, etc.)

✅ Much more flexible and safe for real-world messy data

**🔧 Syntax of pivot_table():**

pd.pivot_table(data, index=None, columns=None, values=None, aggfunc='mean')

**Parameters:**

| Parameter | Description                                              |
| --------- | -------------------------------------------------------- |
| `data`    | The DataFrame                                            |
| `index`   | What becomes the row (like "Department")                 |
| `columns` | What becomes the column (like "Gender")                  |
| `values`  | What fills the cells (like "Salary")                     |
| `aggfunc` | Aggregation function: `'mean'`, `'sum'`, `'count'`, etc. |

In [ ]:
import pandas as pd
data = {
    "Name": ["Ali", "Sara", "John", "Fatima", "David", "Ayesha"],
    "Age": [25, 22, 28, 21, 30, 24],
    "City": ["Lahore", "Karachi", "Islamabad", "Paris", "New York", "Multan"],
    "Gender": ["Male", "Female", "Male", "Female", "Male", "Female"],
    "Salary": [50000,60000,70000,40000,35000,60000],
    "Department": ["CS","MT","CS","EE","CS","HR"]
}
df = pd.DataFrame(data)
print(df)

pivtable = pd.pivot_table(df,index = "Department",columns="City",values="Salary",aggfunc="sum")
print(pivtable)

pivtable = pd.pivot_table(df,index = "Department",columns="Gender",values="Salary",aggfunc="mean")
print(pivtable)


pivtable = pd.pivot_table(df,index = "Department",columns=["Gender","City"],values="Salary",aggfunc="mean",margins=True)
print(pivtable)

pivtable = pd.pivot_table(df,index = "Department",columns="Gender",values="Salary",aggfunc="mean",margins=True)
print(pivtable)


pivtable = pd.pivot_table(df,index = "Department",columns="Gender",values="Salary",aggfunc=["mean","count","sum"],margins=True)
print(pivtable)

     Name  Age       City  Gender  Salary Department
0     Ali   25     Lahore    Male   50000         CS
1    Sara   22    Karachi  Female   60000         MT
2    John   28  Islamabad    Male   70000         CS
3  Fatima   21      Paris  Female   40000         EE
4   David   30   New York    Male   35000         CS
5  Ayesha   24     Multan  Female   60000         HR
City        Islamabad  Karachi   Lahore   Multan  New York    Paris
Department
CS            70000.0      NaN  50000.0      NaN   35000.0      NaN
EE                NaN      NaN      NaN      NaN       NaN  40000.0
HR                NaN      NaN      NaN  60000.0       NaN      NaN
MT                NaN  60000.0      NaN      NaN       NaN      NaN
Gender       Female          Male
Department
CS              NaN  51666.666667
EE          40000.0           NaN
HR          60000.0           NaN
MT          60000.0           NaN
Gender       Female                        Male                    \
City        Karachi   Multan    Paris Islamabad   Lahore New York
Department
CS              NaN      NaN      NaN   70000.0  50000.0  35000.0
EE              NaN      NaN  40000.0       NaN      NaN      NaN
HR              NaN  60000.0      NaN       NaN      NaN      NaN
MT          60000.0      NaN      NaN       NaN      NaN      NaN
All         60000.0  60000.0  40000.0   70000.0  50000.0  35000.0

Gender               All
City
Department
CS          51666.666667
EE          40000.000000
HR          60000.000000
MT          60000.000000
All         52500.000000
Gender            Female          Male           All
Department
CS                   NaN  51666.666667  51666.666667
EE          40000.000000           NaN  40000.000000
HR          60000.000000           NaN  60000.000000
MT          60000.000000           NaN  60000.000000
All         53333.333333  51666.666667  52500.000000
                    mean                              count           \
Gender            Female          Male           All Female Male All
Department
CS                   NaN  51666.666667  51666.666667    NaN  3.0   3
EE          40000.000000           NaN  40000.000000    1.0  NaN   1
HR          60000.000000           NaN  60000.000000    1.0  NaN   1
MT          60000.000000           NaN  60000.000000    1.0  NaN   1
All         53333.333333  51666.666667  52500.000000    3.0  3.0   6

                 sum
Gender        Female      Male     All
Department
CS               NaN  155000.0  155000
EE           40000.0       NaN   40000
HR           60000.0       NaN   60000
MT           60000.0       NaN   60000
All         160000.0  155000.0  315000

**Data Reshaping using pd.melt():**

pd.melt(frame, id_vars=None, value_vars=None, var_name=None, value_name='value')


| Parameter    | Description                                                              |
| ------------ | ------------------------------------------------------------------------ |
| `frame`      | The DataFrame to melt.                                                   |
| `id_vars`    | Columns to keep **as-is** (these will remain as identifier columns).     |
| `value_vars` | Columns to **unpivot** (converted into two columns: variable and value). |
| `var_name`   | Name of the new column holding the names of the melted columns.          |
| `value_name` | Name of the new column holding the values of the melted columns.         |

In [ ]:
import pandas as pd
wide_data = {
    "Name" : ["Ali","Sara"],
    "Maths": [80,90],
    "Science": [60,65],
    "English": [70,75]
}
df = pd.DataFrame(wide_data)
print(df)

# Convert it to long format
long_data = pd.melt(df,id_vars="Name",var_name="Subject",value_name="Marks")
print(long_data)

   Name  Maths  Science  English
0   Ali     80       60       70
1  Sara     90       65       75
   Name  Subject  Marks
0   Ali    Maths     80
1  Sara    Maths     90
2   Ali  Science     60
3  Sara  Science     65
4   Ali  English     70
5  Sara  English     75

**DateTime:**

In [ ]:
import pandas as pd
data = {
    'order_id': [101, 102, 103],
    'order_date': ['2024-12-01', '2025-01-15', '2025-03-30'],
    'delivery_date': ['2024-12-05', '2025-01-20', '2025-04-02']
}
df = pd.DataFrame(data)
print(df)

# 1. Convert to datetime
df['order_date'] = pd.to_datetime(df['order_date'])
df['delivery_date'] = pd.to_datetime(df['delivery_date'])

# 2. Extract components
df['year'] = df['order_date'].dt.year
df['month'] = df['order_date'].dt.month
df['day_name'] = df['order_date'].dt.day_name()
print(df)

# 3. Date arithmetic
df['delivery_days'] = (df['delivery_date'] - df['order_date']).dt.days
df['order_plus_7'] = df['order_date'] + pd.Timedelta(days=7)
print(df)

   order_id  order_date delivery_date
0       101  2024-12-01    2024-12-05
1       102  2025-01-15    2025-01-20
2       103  2025-03-30    2025-04-02
   order_id order_date delivery_date  year  month   day_name
0       101 2024-12-01    2024-12-05  2024     12     Sunday
1       102 2025-01-15    2025-01-20  2025      1  Wednesday
2       103 2025-03-30    2025-04-02  2025      3     Sunday
   order_id order_date delivery_date  year  month   day_name  delivery_days  \
0       101 2024-12-01    2024-12-05  2024     12     Sunday              4
1       102 2025-01-15    2025-01-20  2025      1  Wednesday              5
2       103 2025-03-30    2025-04-02  2025      3     Sunday              3

  order_plus_7
0   2024-12-08
1   2025-01-22
2   2025-04-06

**Data Cleaning essentials:**

| Topic               | Method Used                                 |
| ------------------- | ------------------------------------------- |
| Missing Values      | `dropna()`, `fillna()`                      |
| Datatype Conversion | `astype()`, `to_datetime()`                 |
| String Cleaning     | `str.strip()`, `str.lower()`, `str.title()` |
| Duplicate Handling  | `drop_duplicates()`                         |
| Index Resetting     | `reset_index()`                             |
| Column Renaming     | `rename()`                                  |

In [ ]:
import pandas as pd
import numpy as np
data = {
    'Name': ['  Ali', 'Sara ', 'JOHN', 'NaN', None],
    'Age': [25, np.nan, 30, 28, None],
    'City': ['Lahore', 'Karachi', np.nan, 'Islamabad', 'Lahore'],
    'Gender': ['Male', 'Female', 'MALE', 'Female', 'male'],
    'Joined': ['2024-01-01', 'not_a_date', '2024-03-15', '2024-03-20', '2024-04-01']
}
df = pd.DataFrame(data)
print(df)

df = df.dropna(subset=["Name"])
print(df)
df["Age"] = df["Age"].fillna(df["Age"].mean())
print(df)
df["Gender"] = df["Gender"].fillna(df["Gender"].mode())
print(df)
df["City"] = df["City"].fillna("Unknown")
print(df)

# Fix datatypes
df["Age"] = df["Age"].astype(int)
print(df)
df["Joined"] = pd.to_datetime(df["Joined"],errors="coerce")
print(df)

# Clean Strings
df["Gender"] = df["Gender"].str.capitalize()
print(df)
df["Name"] = df["Name"].str.title()
print(df)

df = df.drop_duplicates()
print(df)

df.reset_index(drop=True,inplace=True)
print(df)

df.rename(columns={"Joined":"Join Date"},inplace = True)
print(df)
print("Cleaned Data")

    Name   Age       City  Gender      Joined
0    Ali  25.0     Lahore    Male  2024-01-01
1  Sara    NaN    Karachi  Female  not_a_date
2   JOHN  30.0        NaN    MALE  2024-03-15
3    NaN  28.0  Islamabad  Female  2024-03-20
4   None   NaN     Lahore    male  2024-04-01
    Name   Age       City  Gender      Joined
0    Ali  25.0     Lahore    Male  2024-01-01
1  Sara    NaN    Karachi  Female  not_a_date
2   JOHN  30.0        NaN    MALE  2024-03-15
3    NaN  28.0  Islamabad  Female  2024-03-20
    Name        Age       City  Gender      Joined
0    Ali  25.000000     Lahore    Male  2024-01-01
1  Sara   27.666667    Karachi  Female  not_a_date
2   JOHN  30.000000        NaN    MALE  2024-03-15
3    NaN  28.000000  Islamabad  Female  2024-03-20
    Name        Age       City  Gender      Joined
0    Ali  25.000000     Lahore    Male  2024-01-01
1  Sara   27.666667    Karachi  Female  not_a_date
2   JOHN  30.000000        NaN    MALE  2024-03-15
3    NaN  28.000000  Islamabad  Female  2024-03-20
    Name        Age       City  Gender      Joined
0    Ali  25.000000     Lahore    Male  2024-01-01
1  Sara   27.666667    Karachi  Female  not_a_date
2   JOHN  30.000000    Unknown    MALE  2024-03-15
3    NaN  28.000000  Islamabad  Female  2024-03-20
    Name  Age       City  Gender      Joined
0    Ali   25     Lahore    Male  2024-01-01
1  Sara    27    Karachi  Female  not_a_date
2   JOHN   30    Unknown    MALE  2024-03-15
3    NaN   28  Islamabad  Female  2024-03-20
    Name  Age       City  Gender     Joined
0    Ali   25     Lahore    Male 2024-01-01
1  Sara    27    Karachi  Female        NaT
2   JOHN   30    Unknown    MALE 2024-03-15
3    NaN   28  Islamabad  Female 2024-03-20
    Name  Age       City  Gender     Joined
0    Ali   25     Lahore    Male 2024-01-01
1  Sara    27    Karachi  Female        NaT
2   JOHN   30    Unknown    Male 2024-03-15
3    NaN   28  Islamabad  Female 2024-03-20
    Name  Age       City  Gender     Joined
0    Ali   25     Lahore    Male 2024-01-01
1  Sara    27    Karachi  Female        NaT
2   John   30    Unknown    Male 2024-03-15
3    Nan   28  Islamabad  Female 2024-03-20
    Name  Age       City  Gender     Joined
0    Ali   25     Lahore    Male 2024-01-01
1  Sara    27    Karachi  Female        NaT
2   John   30    Unknown    Male 2024-03-15
3    Nan   28  Islamabad  Female 2024-03-20
    Name  Age       City  Gender     Joined
0    Ali   25     Lahore    Male 2024-01-01
1  Sara    27    Karachi  Female        NaT
2   John   30    Unknown    Male 2024-03-15
3    Nan   28  Islamabad  Female 2024-03-20
    Name  Age       City  Gender  Join Date
0    Ali   25     Lahore    Male 2024-01-01
1  Sara    27    Karachi  Female        NaT
2   John   30    Unknown    Male 2024-03-15
3    Nan   28  Islamabad  Female 2024-03-20
Cleaned Data

In [ ]:
import pandas as pd

messy_data = pd.DataFrame({
    'ID': [1.521,1, 2, 3, 4, 5, 5, 6, 7, 1],  # Duplicate ID
    'Name': ['Alice Johnson','Alice Johnson', 'bob smith', 'CHARLIE BROWN', 'diana prince', None, 'eve adams', 'Frank Miller', 'grace hopper', 'henry ford'],
    'Age': [25,25, 30, 35, None, 28, 28, 31, None, 45],
    'Email': ['alice@email.com','alice@email.com', 'bob@email.com', 'charlie@EMAIL.COM', 'diana@email.com', 'eve@email.com', 'eve@email.com', None, 'grace@email.com', 'henry@email'],
    'Salary': [50000,50000, 55000, None, 48000, 52000, 52000, 60000, '65000', 70000],
    'Join_Date': ['2020-01-15','2020-01-15', '2019-05-20', '2018-13-10', '2021-07-01', None, '2020-11-30', '2022-03-15', '2021-09-10', '2023-01-20']
})
print("Uncleaned Data:")
print(messy_data)

df = messy_data.copy()

df["ID"] = df["ID"].round().astype(int)
df["Age"] = df["Age"].fillna(df["Age"].mean())
df["Age"] = df["Age"].astype(int)
df["Join_Date"] = pd.to_datetime(df["Join_Date"], errors= "coerce")
df["Salary"] = pd.to_numeric(df["Salary"],errors="coerce")
df["Salary"] = df["Salary"].fillna(df["Salary"].mean())
df["Email"] = df["Email"].fillna("Unknown")
df["Email"] = df["Email"].str.lower()
df["Name"] = df["Name"].fillna("Unknown Unknown")
df["Name"] = df["Name"].str.title()
df[["First Name","Last Name"]] = df["Name"].str.split(" ",n=1,expand = True)
df["Name"] = df["Name"].str.title()
df = df.drop_duplicates(subset= ["Name","Email"])
print("Cleaned Data:")
print(df)

Uncleaned Data:
      ID           Name   Age              Email Salary   Join_Date
0  1.521  Alice Johnson  25.0    alice@email.com  50000  2020-01-15
1  1.000  Alice Johnson  25.0    alice@email.com  50000  2020-01-15
2  2.000      bob smith  30.0      bob@email.com  55000  2019-05-20
3  3.000  CHARLIE BROWN  35.0  charlie@EMAIL.COM   None  2018-13-10
4  4.000   diana prince   NaN    diana@email.com  48000  2021-07-01
5  5.000           None  28.0      eve@email.com  52000        None
6  5.000      eve adams  28.0      eve@email.com  52000  2020-11-30
7  6.000   Frank Miller  31.0               None  60000  2022-03-15
8  7.000   grace hopper   NaN    grace@email.com  65000  2021-09-10
9  1.000     henry ford  45.0        henry@email  70000  2023-01-20
Cleaned Data:
   ID             Name  Age              Email        Salary  Join_Date  \
0   2    Alice Johnson   25    alice@email.com  50000.000000 2020-01-15
2   2        Bob Smith   30      bob@email.com  55000.000000 2019-05-20
3   3    Charlie Brown   35  charlie@email.com  55777.777778        NaT
4   4     Diana Prince   30    diana@email.com  48000.000000 2021-07-01
5   5  Unknown Unknown   28      eve@email.com  52000.000000        NaT
6   5        Eve Adams   28      eve@email.com  52000.000000 2020-11-30
7   6     Frank Miller   31            unknown  60000.000000 2022-03-15
8   7     Grace Hopper   30    grace@email.com  65000.000000 2021-09-10
9   1       Henry Ford   45        henry@email  70000.000000 2023-01-20

  First Name Last Name
0      Alice   Johnson
2        Bob     Smith
3    Charlie     Brown
4      Diana    Prince
5    Unknown   Unknown
6        Eve     Adams
7      Frank    Miller
8      Grace    Hopper
9      Henry      Ford

| Function           | Description                             |
| ------------------ | --------------------------------------- |
| `str.lower()`      | All lowercase                           |
| `str.upper()`      | All uppercase                           |
| `str.title()`      | First letter capitalized in each word   |
| `str.capitalize()` | Capitalize first letter of whole string |

**.str.strip()**

Purpose: Removes leading and trailing whitespace (or characters).
Series.str.strip(to_strip=None)

| Argument   | Description                                                     |
| ---------- | --------------------------------------------------------------- |
| `to_strip` | Characters to remove (default: whitespace). E.g., `"!"`, `"*@"` |

s = pd.Series(["  hello  ", "**wow**"])

s.str.strip()         # removes spaces

s.str.strip("*")      # removes '*' from both ends

**.str.lstrip() / .str.rstrip()**

Purpose: Remove characters only from the left or right.

Series.str.lstrip(to_strip=None)
Series.str.rstrip(to_strip=None)

**.str.replace()**

Purpose: Replace parts of strings using a substring or regex pattern

Series.str.replace(pat, repl, n=-1, case=None, regex=True)

| Argument | Description                              |
| -------- | ---------------------------------------- |
| `pat`    | Pattern to match (string or regex)       |
| `repl`   | Replacement string                       |
| `n`      | Max replacements per string (-1 = all)   |
| `case`   | Match case-sensitively (if `regex=True`) |
| `regex`  | If `True`, treats `pat` as regex         |

s = pd.Series(["hello123"])

s.str.replace(r"\d+", "", regex=True)  # → "hello"

**.str.split()**
Purpose: Split strings into lists or separate columns

Series.str.split(pat=None, n=-1, expand=False)

| Argument | Description                          |
| -------- | ------------------------------------ |
| `pat`    | Delimiter (default: any whitespace)  |
| `n`      | Max splits (-1 means all)            |
| `expand` | If `True`, returns DataFrame columns |

s = pd.Series(["John Smith"])

s.str.split(" ", n=1, expand=True)